import "./usageAgreement.scss";

export const UsageAgreement = () => {
    return (
        <section className="usage-agreement">
            <h3>Օգտագործման համաձայնագիր</h3>
            <p>
                Դառնալով The Mega Store-ի օգտատեր` Դուք ընդունում եք սույն օգտագործման համաձայնագրի պայմանները:
            </p>
            <p>
                Ձեր հայտարարությունը տեղադրելիս` Դուք կրում եք պարունակության ամբողջ պատասխանատվությունը: Կայքն իրավունք է վերապահում չհրապարակել կամ իր կողմից հեռացնել անպատշաճ բովանդակության հայտարարությունը:
            </p>
            <h3>Կողմերի իրավունքներն ու պարտականությունները</h3>
            <p>
                List.am-ում հայտնված բոլոր տեղեկությունները և նյութերը պաշտպանված են հեղինակային իրավունքով և պատկանում են List.am-ին կամ որպես տեղեկատվության տեղադրող նշված կողմին:
            </p>
            <p>
                Դուք չեք կարող պատճենել, վերարտադրել, տարածել, հրապարակել, ածանցյալ ստեղծագործություններ ստեղծել, պահել էլեկտրոնային եղանակով, փոխանցել կամ որևէ կերպ առևտրային կամ այլ նպատակներով օգուտ քաղել List.am-ում տեղադրված ցանկացած բովանդակությունից կամ տեղեկատվությունից:
            </p>
            <p>
                Օգտվելով List.am-ի ծառայություններից, Դուք ընդունում եք, որ բացառապես Դուք եք պատասխանատու Ձեր գովազդի բովանդակության համար և ունեք բոլոր անհրաժեշտ իրավունքները, լիցենզիաները, թույլտվությունները գովազդում պարունակվող ամբողջ տեղեկատվության նկատմամբ, ներառյալ՝ առանց սահմանափակման, բոլոր արտոնագրերը, ապրանքանիշերը, առևտրային գաղտնիքները, հեղինակային իրավունքները, կամ այդ տեղեկատվությունը օգտագործելու համար ունեք գովազդում նշված բոլոր անհատների և ընկերությունների համապատասխան գրավոր համաձայնությունը, լիցենզիան կամ թույլտվությունը:
            </p>
            <p>
                Եթե ​​դուք List.am-ում գովազդներ եք տեղադրում՝ տրամադրելով կեղծ կոնտակտային տվյալներ կամ որպես մեկ այլ անձ եք ներկայանում, ապա մենք մեզ իրավունք ենք վերապահում փոխանցել Ձեր տվյալները տուժող երրորդ կողմին, նրանց գործակալներին կամ իրավապահ մարմիններին:
            </p>
            <ul>
                Դուք համաձայն եք.
                <li>
                    Չձեռնարկել որևէ գործողություն, որը կարող է հանգեցնել կայքի ենթակառուցվածքի գերբեռնավորման:
                </li>
                <li>
                    Չօգտագործել ավտոմատացված ծրագրեր մուտք ստանալու համար:
                </li>
                <li>
                    Չմիջամտել կամ չփորձել միջամտել կայքի բնականոն գործունեությանը և այլ գործողություններին, ինչպես նաև չմիջամտել ավտոմատ համակարգերի կամ գործընթացների գործողություններին:
                </li>
                <li>
                    Չօգտագործել այլ օգտատերերի կողմից տրամադրած տեղեկատվությունը օգտատիրոջ հետ գործարք կնքելուց բացի որևէ այլ նպատակով:
                </li>
                <li>
                    Չքննարկել մոդերատորների և կայքի ադմինիստրացիայի գործողությունները որևէ տեղ և որևէ մեկի հետ, բացառությամբ մոդերատորների հետ էլեկտրոնային նամակագրության միջոցով:
                </li>
                <li>
                    Չօգտագործել այլ օգտատերերի անուններին նման անուններ այլ օգտատերերի նմանակման կամ նրանց անունից հաղորդագրություններ գրելու համար:
                </li>
            </ul>
            <p>
                List.am-ը գործադրում է բոլոր ողջամիտ ջանքերը սույն Համաձայնագրով նախատեսված իր պարտավորությունները կատարելու, այդ թվում ծառայությունների բնականոն աշխատանքը և երրորդ կողմ հանդիսացող օգտվողների անձնական տվյալները պաշտպանելու համար, եթե միայն հակառակը չի պահանջվում օրենքով:
            </p>
            <p>
                List.am-ը կարող է պարբերաբար իր ծառայություններից օգտվելու սահմանափակումներ մտցնել, մասնավորապես՝ տեղեկատվության վավերականության առավելագույն տևողության և չափերի սահմանափակումների առնչությամբ:
            </p>
            <p>
                List.am-ը ցանկացած պահի կարող է առանց նախնական ծանուցման փոխել կայքի ցանկացած գործառույթ կամ հնարավորություն ու բովանդակություն՝ առանց որևէ պատասխանատվություն կրելու նման փոփոխությունների համար:
            </p>
            <p>
                Իր բովանդակության և ծառայությունների բարձր որակը պահպանելու համար List.am-ը իրեն իրավունք է վերապահում սահմանափակել յուրաքանչյուր օգտատիրոջ ակտիվ գովազդների քանակը և սահմանափակել կամ արգելափակել List.am-ի ցանկացած օգտատերերի ցանկացած գործողություն:
            </p>
            <p>
                List.am-ը իրավունք ունի մերժել օգտատիրոջ մուտքը կայք, եթե օգտատերը խախտում է սույն պայմանագրի պայմանները: List.am-ն իրեն իրավունք է վերապահում առանց որևէ նախնական ծանուցման և իր հայեցողությամբ ցանկացած պահի ջնջել կամ անջատել օգտատիրոջ հաշիվը և հեռացնել օգտատիրոջ կողմից տեղադրված բոլոր գովազդները՝ առանց պատասխանատվություն կրելու իր գործողությունների համար օգտատիրոջ և երրորդ անձանց նկատմամբ:
            </p>
            <p>
                List.am-ն իրեն իրավունք է վերապահում ցանկացած պահի պահանջել օգտատիրոջից հաստատել գրանցման ընթացքում կամ գովազդում նշված տեղեկատվությունը և պահանջել օժանդակ փաստաթղթեր (մասնավորապես՝ անձը հաստատող փաստաթղթերի պատճեններ), որոնց չտրամադրումը օգտատիրոջ կողմից կգնահատվի որպես կեղծ տեղեկատվություն տրամադրում։ Եթե ​​List.am-ին տրամադրված փաստաթղթերում նշված օգտատիրոջ տվյալները չեն համընկնում գրանցման կամ գովազդի մեջ նշված տվյալներին, ինչպես նաև այն դեպքում, երբ գրանցման կամ գովազդի մեջ նշված տվյալները պատշաճ կերպով չեն նույնականացնում օգտատիրոջը, ապա List.am-ը կարող է մերժել օգտատիրոջ մուտքը կայք՝ նախնական ծանուցմամբ կամ առանց դրա:
            </p>
            <p>
                Օգտագործելով մեր հետադարձ կապի ձևը օգտագործողը իրավունք ունի կայքի ֆունկցիոնալության վերաբերյալ բողոք ներկայացնել, որը կուսումնասիրվի բողոքի ստացման կամ դրա բնույթի վերաբերյալ ամբողջական տեղեկատվության ստացման օրվանից հաշված երեք աշխատանքային օրվա ընթացքում:
            </p>
        </section>
    )
}